
#Область СлужебныеПроцедурыИФункции
	
	Процедура ПровестиДокументыРеализации(Параметры, АдресРезультата) Экспорт
		
		//МассивВозврат = Новый Массив;
		
		Запрос= Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ДоговорыКонтрагентов.Ссылка КАК Договор,
		|	ВЫБОР
		|		КОГДА РеализацияТоваровУслуг.ПометкаУдаления
		|			ТОГДА """"
		|		ИНАЧЕ РеализацияТоваровУслуг.Ссылка
		|	КОНЕЦ КАК Реализация,
		|	ДоговорыКонтрагентов.Владелец КАК Контрагент
		|ИЗ
		|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
		|		ПОЛНОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
		|		ПО (РеализацияТоваровУслуг.Договор = ДоговорыКонтрагентов.Ссылка)
		|ГДЕ
		|	ВЫБОР
		|			КОГДА НЕ РеализацияТоваровУслуг.Ссылка ЕСТЬ NULL
		|				ТОГДА РеализацияТоваровУслуг.Дата МЕЖДУ &НачалоПериода И &КонецПериода
		|			ИНАЧЕ ИСТИНА
		|		КОНЕЦ
		|	И ДоговорыКонтрагентов.ВидДоговора = &АбонентскоеОбслуживание";      
		Запрос.УстановитьПараметр("АбонентскоеОбслуживание",Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание);
		Запрос.УстановитьПараметр("НачалоПериода",Параметры.НачалоПериода);
		Запрос.УстановитьПараметр("КонецПериода",Параметры.КонецПериода);   
		
		Список = Запрос.Выполнить().Выгрузить();
		
		ВсегоДокументов = Список.Количество();
		
		ТекДок = 1;
		
		Для Каждого Стр11 ИЗ Список Цикл
			
			// создание реализации
			Если не ЗначениеЗаполнено(Стр11.Реализация) Тогда 
				Реализация = Документы.РеализацияТоваровУслуг.СоздатьДокумент();
				Реализация.Дата = ТекущаяДата();
				Реализация.Заполнить(Стр11.Договор);
				Реализация.Записать(РежимЗаписиДокумента.Проведение);
			КонецЕсли;
			
			ПроцентВыполнения = (ТекДок/ВсегоДокументов)*100;
			ПроцентВыполнения = Окр(ПроцентВыполнения,0);
			
			//МассивВозврат.Добавить(ПроцентВыполнения);
			
			// сообщаем "процент" и "текст сообщения"
			ДлительныеОперации.СообщитьПрогресс(ПроцентВыполнения,СокрЛП(Строка(Стр11.Контрагент) + " - " + Строка(Стр11.Договор)));
			
			ТекДок = ТекДок + 1;
			
		КонецЦикла;
		
		//ПоместитьВоВременноеХранилище(МассивВозврат, АдресРезультата);
		
	КонецПроцедуры

#КонецОбласти
