
#Область ОбработчикиСобытийФормы

	&НаСервере
	Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
		
		Если Объект.Ссылка.Пустая() Тогда 
			
			//@skip-check use-non-recommended-method
			ЗаполнениеВыплатНаДату(ТекущаяДата());
			
		КонецЕсли;
		
	КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

	&НаКлиенте
	Процедура Автозаполнение(Команда)
		АвтозаполнениеНаСервере();
	КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции
	&НаСервере
	Процедура ЗаполнениеВыплатНаДату(Дата)
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВКМ_ВзаиморасчетыССотрудникамиОстатки.Сотрудник КАК Сотрудник,
		|	СУММА(ВКМ_ВзаиморасчетыССотрудникамиОстатки.СуммаОстаток) КАК Сумма
		|ИЗ
		|	РегистрНакопления.ВКМ_ВзаиморасчетыССотрудниками.Остатки(&Дата, ) КАК ВКМ_ВзаиморасчетыССотрудникамиОстатки
		|
		|СГРУППИРОВАТЬ ПО
		|	ВКМ_ВзаиморасчетыССотрудникамиОстатки.Сотрудник";
		Запрос.УстановитьПараметр("Дата",Дата);
		
		Объект.Выплаты.Загрузить(Запрос.Выполнить().Выгрузить());
	
	КонецПроцедуры
	
	&НаСервере
	Процедура АвтозаполнениеНаСервере()
		ЗаполнениеВыплатНаДату(Объект.Дата);
	КонецПроцедуры

#КонецОбласти
