
#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, Режим)

	// регистр ВКМ_ПланированиеОтпусков Приход
	Движения.ВКМ_ПланированиеОтпусков.Записывать = Истина; 
	
	Выборка = ПолучитьДанныеДляРасчета();

	Для Каждого ТекСтрокаОтпускаСотрудников Из Выборка Цикл
		Движение = Движения.ВКМ_ПланированиеОтпусков.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Сотрудник = ТекСтрокаОтпускаСотрудников.Сотрудник;
		Движение.Год = Год;
		Движение.КоличествоДней = ТекСтрокаОтпускаСотрудников.Дней;
	КонецЦикла;

КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Функция ПолучитьДанныеДляРасчета() Экспорт 

	ТаблицаОтпусков = Новый ТаблицаЗначений;
	ТаблицаОтпусков.Колонки.Добавить("Сотрудник", Новый ОписаниеТипов("СправочникСсылка.Пользователи"));
	ТаблицаОтпусков.Колонки.Добавить("ДатаНачала", Новый ОписаниеТипов("Дата"));
	ТаблицаОтпусков.Колонки.Добавить("ДатаОкончания", Новый ОписаниеТипов("Дата"));
	
	Для Каждого стр из ОтпускаСотрудников Цикл 
		НовСтр = ТаблицаОтпусков.Добавить();
		ЗаполнитьЗначенияСвойств(НовСтр,стр);
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ОтпускаСотрудников.Сотрудник КАК Сотрудник,
	|	РАЗНОСТЬДАТ(ОтпускаСотрудников.ДатаНачала, ОтпускаСотрудников.ДатаОкончания, ДЕНЬ) КАК Дней
	|ПОМЕСТИТЬ ВТ
	|ИЗ
	|	&ОтпускаСотрудников КАК ОтпускаСотрудников
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ.Сотрудник КАК Сотрудник,
	|	СУММА(ВТ.Дней) КАК Дней
	|ИЗ
	|	ВТ КАК ВТ
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ.Сотрудник";   
	
	Запрос.УстановитьПараметр("ОтпускаСотрудников",ТаблицаОтпусков);
	Выборка = Запрос.Выполнить().Выгрузить();
	
	Возврат Выборка;
	
КонецФункции

#КонецОбласти


