
// Рагозина 09122023 <--

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);    
	
	Если Объект.Ссылка.Пустая() Тогда 
		Объект.Статус = Перечисления.ВКМ_Статусы.Открыт;	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)	
    ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);     
	УстановитьЗапретИзмененияДляСпециалиста();    
	
	//Если Объект.Статус = Перечисления.ВКМ_Статусы.Закрыт Тогда 
	//	Элементы.Статус.Доступность = Ложь;	
	//КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьЗапретИзмененияДляСпециалиста()
		
	// запрет изменения реквизитов и открытия документа для специалистов
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ГруппыДоступа.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ГруппыДоступа КАК ГруппыДоступа
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ПрофилиГруппДоступа КАК ПрофилиГруппДоступа
	|		ПО ГруппыДоступа.Профиль = ПрофилиГруппДоступа.Ссылка
	|ГДЕ
	|	ПрофилиГруппДоступа.Ссылка = &Специалист
	|	И ГруппыДоступа.Пользователь = &Пользователь";
	Запрос.УстановитьПараметр("Специалист",Справочники.ПрофилиГруппДоступа.Специалист);
	Запрос.УстановитьПараметр("Пользователь",Пользователи.ТекущийПользователь());
	Результат = Запрос.Выполнить().Выгрузить();
	Если Результат.Количество() > 0 Тогда 
		Если не Объект.Специалист = Пользователи.ТекущийПользователь() Тогда  
			Сообщение = "Документ предназначен для специалиста " + Объект.Специалист;
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Сообщение);
			ЭтотОбъект.ТолькоПросмотр = Истина;  
		Иначе 
			Элементы.Номер.Доступность = Ложь;
			Элементы.Дата.Доступность = Ложь;
			Элементы.Специалист.Доступность = Ложь;
			Элементы.Договор.Доступность = Ложь;
			Элементы.Клиент.Доступность = Ложь;
			Элементы.ДатаПроведенияРабот.Доступность = Ложь;
			Элементы.ОписаниеПроблемы.Доступность = Ложь;
			Элементы.ВремяНачалаРаботПлан.Доступность = Ложь;
			Элементы.ВремяОкончанияРаботПлан.Доступность = Ложь;   
			//Элементы.Статус.Доступность = Ложь;
		КонецЕсли;                   
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
    ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ПодключаемыеКоманды

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
    ПодключаемыеКомандыКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПродолжитьВыполнениеКомандыНаСервере(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
    ВыполнитьКомандуНаСервере(ПараметрыВыполнения);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьКомандуНаСервере(ПараметрыВыполнения)
    ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, ПараметрыВыполнения, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
    ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти

#КонецОбласти

// Рагозина -->

