
#Область ОбработчикиСобытийФормы

	&НаСервере
	Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
		СформироватьНаСервере();
	КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

	&НаКлиенте
	Процедура Сформировать(Команда)
		СформироватьНаСервере();
	КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

	&НаСервере
	Процедура СформироватьНаСервере()
		
		//Если не ЗначениеЗаполнено(Период) Тогда 
		//	ОбщегоНазначения.СообщитьПользователю("Не заполнен период!");
		//	Возврат;
		//КонецЕсли;
		
		Диаграмма.Очистить();
		
		Данные = ПолучитьИзВременногоХранилища(Параметры.Адрес);
		
		Для Каждого СтрокаДанные из Данные Цикл 
			
			Точка = Диаграмма.УстановитьТочку(СтрокаДанные.Сотрудник);
			Серия = Диаграмма.УстановитьСерию("Отпуск");
			
			Значение = Диаграмма.ПолучитьЗначение(Точка,Серия);
			Интервал = Значение.Добавить();
			Интервал.Начало = СтрокаДанные.ДатаНачала;
			Интервал.Конец = СтрокаДанные.ДатаОкончания;
			
		КонецЦикла;
	
	КонецПроцедуры

#КонецОбласти
