
// Рагозина 09122023 <--

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ВКМ_ВидимостьДополнительныхЗначенийДоговора();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ВидДоговораПриИзменении(Элемент)
	ВКМ_ВидимостьДополнительныхЗначенийДоговора();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ВКМ_ВидимостьДополнительныхЗначенийДоговора()
	Если Объект.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание Тогда
		Элементы.ВКМ_ДополнительныеЗначения.Видимость = Истина;	
	КонецЕсли;
КонецПроцедуры

#КонецОбласти 

// Рагозина -->