
#Область ОбработчикиСобытийЭлементовТаблицыФормыОсновныеНачисления

&НаКлиенте
Процедура ОсновныеНачисленияСотрудникПриИзменении(Элемент)
	ТекСтрока = Элементы.ОсновныеНачисления.ТекущиеДанные;
	ТекСтрока.Подразделение = ПолучитьПодразделениеПоСотруднику(ТекСтрока.Сотрудник);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ПолучитьПодразделениеПоСотруднику(Сотрудник)
	 Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Сотрудник,"Подразделение");
КонецФункции

#КонецОбласти